// Задание №2. Алгоритмы ветвления. Поиск принадлежности
// точки определенной области.
void main() {
  var x1 = 0.5, y1 = 0.75;
  var x2 = 1.5, y2 = 1.3;
  var x3 = 0.1, y3 = 0.25;

  dotInArea(x1, y1);
  dotInArea(x2, y2);
  dotInArea(x3, y3);  
}

void dotInArea(num x, y) {
  int flag = 0;

  if (y >= 0 && y <= x * x) {
    if (x < 0) {
      if (y >= 2 - x) {
        flag = 1;
      }
    } else if (y <= 2 - x) {
      flag = 1;
    }
  }

  if (flag != 0) {
    print('Точка с координатами ($x;$y) принадлежит заштрихованной области!');
  } else {
    print(
        'Точка с координатами ($x;$y) не принадлежит заштрихованной области!');
  }
}